_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПравилаРаспределенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ПравилаРаспределенияНДС</Name>
			<Comment>Правила распределения НДС (УСО)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНДСДляВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНеНДСДляВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНДСДляНеВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНеНДСДляНеВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНДСДляВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНеНДСДляВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНДСДляНеВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаНеНДСДляНеВведенныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПравилаРаспределенияНДС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ВариантДляВведенныхОбъектов = ?(Объект.БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов, 1, 0);
	ВариантДляНеВведенныхОбъектов = ?(Объект.БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов, 1, 0);
	
	УстановитьВидимостьСтраницВЗависимостиОтвариантаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЕстьОшибка = Ложь;
	//Если Объект.ДляКомплексныхРасходов Тогда
	//	
	//	Если Не ЗначениеЗаполнено(Объект.ФормулаПлан) Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана формула для расчета доли НДС для строищихся объектов.", Объект.Ссылка, "Объект.ФормулаПлан");
	//		ЕстьОшибка = Истина;
	//	КонецЕсли;
	//	
	//	Если Не ЗначениеЗаполнено(Объект.ФормулаФакт) Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана формула для расчета доли НДС для завершенных объектов.", Объект.Ссылка, "Объект.ФормулаФакт");
	//		ЕстьОшибка = Истина;
	//	КонецЕсли;     
	//		
	//Иначе
		Если Не Объект.БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ФормулаНДСДляВведенныхОбъектов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для введенных в эксплуатацию объектов не указана формула расчета для деятельности, облагаемой НДС.", Объект.Ссылка, "Объект.ФормулаНДСДляВведенныхОбъектов");
				ЕстьОшибка = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ФормулаНеНДСДляВведенныхОбъектов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для введенных в эксплуатацию объектов не указана формула расчета для деятельности, не облагаемой НДС.", Объект.Ссылка, "Объект.ФормулаНеНДСДляВведенныхОбъектов");
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		
		Если Не Объект.БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ФормулаНДСДляНеВведенныхОбъектов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для не введенных в эксплуатацию объектов не указана формула расчета для деятельности, облагаемой НДС.", Объект.Ссылка, "Объект.ФормулаНДСДляНеВведенныхОбъектов");
				ЕстьОшибка = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ФормулаНеНДСДляНеВведенныхОбъектов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для не введенных в эксплуатацию объектов не указана формула расчета для деятельности, не облагаемой НДС.", Объект.Ссылка, "Объект.ФормулаНеНДСДляНеВведенныхОбъектов");
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;

	Отказ = ЕстьОшибка;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантДляНеВведенныхОбъектовПриИзменении(Элемент)
	
	Объект.БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов = (ВариантДляНеВведенныхОбъектов = 1);
	УстановитьВидимостьСтраницВЗависимостиОтвариантаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантДляВведенныхОбъектовПриИзменении(Элемент)
	
	Объект.БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов = (ВариантДляВведенныхОбъектов = 1);
	УстановитьВидимостьСтраницВЗависимостиОтвариантаРасчета();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьФормулуНДСДляНеВведенныхОбъектов(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаНДСДляНеВведенныхОбъектов);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуНДСДляНеВведенныхОбъектовЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНеНДСДляНеВведенныхОбъектов(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаНеНДСДляНеВведенныхОбъектов);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуНеНДСДляНеВведенныхОбъектовЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНДСДляВведенныхОбъектов(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаНДСДляВведенныхОбъектов);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуНДСДляВведенныхОбъектовЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНеНДСДляВведенныхОбъектов(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаНеНДСДляВведенныхОбъектов);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуНеНДСДляВведенныхОбъектовЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуПлан(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаПлан);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуПланЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуФакт(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТекущаяФормула", Объект.ФормулаФакт);
	
	ОткрытьФорму("Справочник.УСОERP_ПравилаРаспределенияНДС.Форма.ФормаРедактированияФормулы", СтруктураПараметров, ЭтаФорма,,,,Новый ОписаниеОповещения("ИзменитьФормулуФактЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьСтраницВЗависимостиОтВариантаРасчета()
	
	//Элементы.ГруппаНДС.Видимость = (НЕ Объект.ДляКомплексныхРасходов);
	//Элементы.ГруппаРасходы.Видимость = Объект.ДляКомплексныхРасходов;
	
	Элементы.ГруппаРучноеРаспределениеДляНеВведенныхОбъектов.Видимость = Объект.БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов;
	Элементы.ГруппаАвтоматическоеРаспределениеДляНеВведенных.Видимость = (НЕ Объект.БазаРаспределенияУстанавливаетсяВручнуюДляНеВведенныхОбъектов);
	
	Элементы.ГруппаРучноеРаспределениеДляВведенных.Видимость = Объект.БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов;
	Элементы.ГруппаАвтоматическоеРаспределениеДляВведенных.Видимость = (НЕ Объект.БазаРаспределенияУстанавливаетсяВручнуюДляВведенныхОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНДСДляНеВведенныхОбъектовЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаНДСДляНеВведенныхОбъектов =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНеНДСДляНеВведенныхОбъектовЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаНеНДСДляНеВведенныхОбъектов =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНДСДляВведенныхОбъектовЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаНДСДляВведенныхОбъектов =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуНеНДСДляВведенныхОбъектовЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаНеНДСДляВведенныхОбъектов =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуПланЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаПлан =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуФактЗавершение(РезультатИзменения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатИзменения = Неопределено Тогда
		Объект.ФормулаФакт =  РезультатИзменения;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
